app/controllers/api/v1/pages_controller.rb

  def crawl

    # Check if the page already exists
    page = Page.find_by_link(params[:link])
    render :json => {:data => page } and return if page.present? and !params[:override].present?

    # Override an old page if exists
    page.destroy if page.present?
    page = Page.create(link: params[:link])

    # Process using NOKOGIRI
    doc = Nokogiri::HTML(open(params[:link]))

    # TARGET LIST
    targets = ["h1","h2","h3", "a"]

    # SEARCH FOR EACH TARGET
    targets.each do |target|
      doc.css(target).each do |result|
        #INSERT CONTENT IN DB
        if target == "a"
          Content.create(:target => target, :page_id => page.id, :occurrence => result['href']) if result['href'].include?("http")
---
SELECT  `pages`.* FROM `pages` WHERE `pages`.`link` = 'https://github.com' LIMIT 1
DELETE FROM `pages` WHERE `pages`.`id` = 1
INSERT INTO `pages` (`link`, `created_at`, `updated_at`) VALUES (NULL, '2017-01-25 11:22:32', '2017-01-25 11:22:32')
INSERT INTO `contents` (`target`, `page_id`, `occurrence`, `created_at`, `updated_at`) VALUES (0, 2, 'How people build software', '2017-01-25 11:36:59', '2017-01-25 11:36:59')
SELECT `contents`.* FROM `contents` WHERE `contents`.`page_id` = 2